<template>
  <section class="card">
    <dl class="board-view">
      <dt>
        <b>주택화재 손해 인정 기준 요약</b>
        <i>2025-03-14</i>
      </dt>
      <dd>주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다. 다만, 보험 가입 시 명시된 보험가입금액 한도 내에서만 지급되며, 화재 발생 원인이 고의 또는 중대한 과실일 경우 보험금이 감액되거나 지급이 제한될 수 있습니다.

      주택화재의 경우 건물, 가재도구, 벽지·장판 등은 보상 가능 항목에 포함됩니다.
      </dd>
    </dl>
    <div class="form-mix flex-center">
      <a @click="backToList" class="btn-md btn-basic w120px">목록</a>
    </div>
  </section>
</template>

<script setup>
import { defineProps, defineEmits, ref, onMounted, watch } from 'vue'
import { global } from 'assets/js/publish/global'
import { useRoute, useRouter } from 'vue-router'

const route = useRoute()
const router = useRouter()

const id = route.params.id ?? null

console.log("msgId : ", id)

onMounted(() => {
  console.log('🟢 DetailManual mounted, id:', route.params.id)
})


const backToList = () => {
  router.back();
}

</script>
